; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
(define (problem transport-96)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 v5 v6 v7 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 p14 p15 p16 p17 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 l12 l13 l14 l15 l16 - location
    c0 c1 c2 c3 - size
    )
 (:init (capacity v1 c1)
    (capacity v2 c1)
    (capacity v3 c2)
    (capacity v4 c2)
    (capacity v5 c1)
    (capacity v6 c1)
    (capacity v7 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (capacity-predecessor c2 c3)
    (at p1 l12)
    (at p2 l1)
    (at p3 l13)
    (at p4 l11)
    (at p5 l13)
    (at p6 l16)
    (at p7 l5)
    (at p8 l14)
    (at p9 l11)
    (at p10 l1)
    (at p11 l1)
    (at p12 l5)
    (at p13 l16)
    (at p14 l12)
    (at p15 l6)
    (at p16 l12)
    (at p17 l8)
    (at v1 l16)
    (at v2 l13)
    (at v3 l11)
    (at v4 l11)
    (at v5 l1)
    (at v6 l13)
    (at v7 l11)
    (road l14 l10)
    (road l5 l13)
    (road l4 l15)
    (road l11 l8)
    (road l13 l5)
    (road l16 l1)
    (road l2 l14)
    (road l16 l13)
    (road l7 l10)
    (road l3 l6)
    (road l5 l12)
    (road l8 l11)
    (road l10 l11)
    (road l9 l13)
    (road l11 l10)
    (road l10 l14)
    (road l15 l4)
    (road l13 l10)
    (road l13 l16)
    (road l12 l5)
    (road l14 l2)
    (road l4 l1)
    (road l9 l6)
    (road l10 l7)
    (road l10 l13)
    (road l1 l4)
    (road l13 l9)
    (road l1 l16)
    (road l6 l3)
    (road l6 l9)
    (road l3 l12)
    (road l12 l3)
    (road l1 l3)
    (road l3 l1)
    (road l14 l15)
    (road l15 l14)
    (road l9 l10)
    (road l10 l9)
    (road l2 l4)
    (road l4 l2)
    (road l13 l15)
    (road l15 l13)
    (road l4 l8)
    (road l8 l4)
    (road l5 l11)
    (road l11 l5)
    (road l2 l6)
    (road l6 l2)
    (road l7 l14)
    (road l14 l7)
    (road l5 l16)
    (road l16 l5)
    (road l5 l10)
    (road l10 l5)
    (road l6 l12)
    (road l12 l6)
    (road l2 l8)
    (road l8 l2)
    (road l3 l10)
    (road l10 l3)
    (road l7 l15)
    (road l15 l7)
    (road l1 l14)
    (road l14 l1)
    (road l4 l10)
    (road l10 l4)
    (road l2 l3)
    (road l3 l2)
    (road l15 l16)
    (road l16 l15)
    (road l1 l7)
    (road l7 l1)
    (road l4 l7)
    (road l7 l4)
    (road l6 l15)
    (road l15 l6)
    (road l13 l14)
    (road l14 l13)
    (road l3 l11)
    (road l11 l3)
    (road l1 l12)
    (road l12 l1)
    (road l9 l15)
    (road l15 l9)
    (road l4 l16)
    (road l16 l4)
    (road l1 l8)
    (road l8 l1)
    )
 (:goal (and 
(at p1 l13)
(at p2 l10)
(at p3 l12)
(at p4 l1)
(at p5 l12)
))
)

; plan
1. (pick-up v4 l11 p4 c1 c2)
   deleted: (at p4 l11) (capacity v4 c2)
   added: (in p4 v4) (capacity v4 c1)
   goals met: 0 of 5
2. (drive v4 l11 l3)
   deleted: (at v4 l11)
   added: (at v4 l3)
   goals met: 0 of 5
3. (drive v4 l3 l1)
   deleted: (at v4 l3)
   added: (at v4 l1)
   goals met: 0 of 5
4. (pick-up v4 l1 p2 c0 c1)
   deleted: (at p2 l1) (capacity v4 c1)
   added: (in p2 v4) (capacity v4 c0)
   goals met: 0 of 5
5. (drop v4 l1 p4 c0 c1)
   deleted: (in p4 v4) (capacity v4 c0)
   added: (at p4 l1) (capacity v4 c1)
   goals met: 1 of 5
6. (drive v4 l1 l12)
   deleted: (at v4 l1)
   added: (at v4 l12)
   goals met: 1 of 5
7. (pick-up v4 l12 p1 c0 c1)
   deleted: (at p1 l12) (capacity v4 c1)
   added: (in p1 v4) (capacity v4 c0)
   goals met: 1 of 5
8. (drive v4 l12 l3)
   deleted: (at v4 l12)
   added: (at v4 l3)
   goals met: 1 of 5
9. (drive v4 l3 l10)
   deleted: (at v4 l3)
   added: (at v4 l10)
   goals met: 1 of 5
10. (drop v4 l10 p2 c0 c1)
   deleted: (in p2 v4) (capacity v4 c0)
   added: (at p2 l10) (capacity v4 c1)
   goals met: 2 of 5
11. (drive v4 l10 l13)
   deleted: (at v4 l10)
   added: (at v4 l13)
   goals met: 2 of 5
12. (drop v4 l13 p1 c1 c2)
   deleted: (in p1 v4) (capacity v4 c1)
   added: (at p1 l13) (capacity v4 c2)
   goals met: 3 of 5
13. (pick-up v4 l13 p5 c1 c2)
   deleted: (at p5 l13) (capacity v4 c2)
   added: (in p5 v4) (capacity v4 c1)
   goals met: 3 of 5
14. (pick-up v4 l13 p3 c0 c1)
   deleted: (at p3 l13) (capacity v4 c1)
   added: (in p3 v4) (capacity v4 c0)
   goals met: 3 of 5
15. (drive v4 l13 l5)
   deleted: (at v4 l13)
   added: (at v4 l5)
   goals met: 3 of 5
16. (drive v4 l5 l12)
   deleted: (at v4 l5)
   added: (at v4 l12)
   goals met: 3 of 5
17. (drop v4 l12 p3 c0 c1)
   deleted: (in p3 v4) (capacity v4 c0)
   added: (at p3 l12) (capacity v4 c1)
   goals met: 4 of 5
18. (drop v4 l12 p5 c1 c2)
   deleted: (in p5 v4) (capacity v4 c1)
   added: (at p5 l12) (capacity v4 c2)
   goals met: 5 of 5
